IDENTIFICATION DIVISION.      
FUNCTION-ID. GetDay.
DATA DIVISION.
WORKING-STORAGE SECTION.
LINKAGE SECTION.
01 PARAM PIC 9(2).
01 RESULT PIC x(10).
PROCEDURE DIVISION USING PARAM RETURNING RESULT.
   EVALUATE PARAM
     WHEN 1 MOVE 'first' TO RESULT
     WHEN 2 MOVE 'second' TO RESULT
     WHEN 3 MOVE 'third' TO RESULT
     WHEN 4 MOVE 'fourth' TO RESULT
     WHEN 5 MOVE 'fifth' TO RESULT
     WHEN 6 MOVE 'sixth' TO RESULT
     WHEN 7 MOVE 'seventh' TO RESULT
     WHEN 8 MOVE 'eigth' TO RESULT
     WHEN 9 MOVE 'ninth' TO RESULT
     WHEN 10 MOVE 'tenth' TO RESULT
     WHEN 11 MOVE 'eleventh' TO RESULT
     WHEN 12 MOVE 'twelfth' TO RESULT
     GOBACK.
END FUNCTION GetDay.

IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
    REPOSITORY.
        FUNCTION GetDay.
DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 GIFT-TABLE.
      05 GIFT-NAME PIC X(30) OCCURS 12 TIMES.
   01 GIFTS-GIVEN-TABLE.
      05 GIFTS-GIVEN-NAME PIC X(30) OCCURS 12 TIMES.
   01 DAY-COUNT PIC 9(2) VALUE 1. 
   01 GIFTS-GIVEN-COUNT PIC 9(2) VALUE 0.
PROCEDURE DIVISION.

MOVE "Partridge in a pear tree." TO GIFT-NAME(1).
MOVE 'Two Turtle Doves,' TO GIFT-NAME(2).
MOVE 'Three Calling Birds,' TO GIFT-NAME(3).
MOVE 'Four French Hens,' TO GIFT-NAME(4).
MOVE 'Five Gold Rings,' TO GIFT-NAME(5).
MOVE 'Six Geese a Laying,' TO GIFT-NAME(6).
MOVE 'Seven Swans a Swimming,' TO GIFT-NAME(7).
MOVE 'Eight Maids a Milking,' TO GIFT-NAME(8).
MOVE 'Nine Ladies Dancing,' TO GIFT-NAME(9).
MOVE 'Ten Lords a Leaping,' TO GIFT-NAME(10).
MOVE 'Eleven Pipers Piping,' TO GIFT-NAME(11).
MOVE 'Twelve Drummers Drumming,'  TO GIFT-NAME(12).

DISPLAY '12 Days of Christmas'.
DISPLAY '===================='.

PERFORM GIFT-LOOP UNTIL DAY-COUNT > 12

STOP RUN.

GIFT-LOOP.
   DISPLAY 'On the ' FUNCTION TRIM(GetDay(DAY-COUNT)) ' day of christmas my true love gave to me.'.
 
   MOVE GIFT-NAME(DAY-COUNT) TO GIFTS-GIVEN-NAME(DAY-COUNT).
   ADD 1 TO GIFTS-GIVEN-COUNT.
   
   PERFORM GIFTS-GIVEN-LOOP UNTIL GIFTS-GIVEN-COUNT <= 0
   MOVE DAY-COUNT TO GIFTS-GIVEN-COUNT.
   ADD 1 TO DAY-COUNT. 
   
   DISPLAY ' '.

GIFTS-GIVEN-LOOP.
  IF DAY-COUNT IS GREATER THAN 1 AND GIFTS-GIVEN-COUNT EQUALS 1 THEN
    DISPLAY 'And a ' GIFTS-GIVEN-NAME(GIFTS-GIVEN-COUNT)
  ELSE
    IF DAY-COUNT IS GREATER THAN 1 AND GIFTS-GIVEN-COUNT IS GREATER THAN 1 THEN
      DISPLAY GIFTS-GIVEN-NAME(GIFTS-GIVEN-COUNT)
    ELSE
      DISPLAY 'A ' GIFTS-GIVEN-NAME(GIFTS-GIVEN-COUNT)
    END-IF
  END-IF.
  
  SUBTRACT 1 FROM GIFTS-GIVEN-COUNT.
 
